stacks/wsl2-gpu/benchmarks/chat-long-generation.yaml
schema_version: 1
name: wsl2-chat-long-generation-thinking-off
defaults:
  model: qwen-demo
  stream: true
  stream_options:
    include_usage: true
  chat_template_kwargs:
    enable_thinking: false
  temperature: 0.0
  top_p: 1.0
  seed: 42
  max_tokens: 256
execution:
  warmup_requests: 2
  rounds: 5
  concurrency: 1
  timeout_seconds: 180
prompts:
  - id: kubernetes-runbook-ko
    messages:
      - role: user
        content: Kubernetes에서 GPU 추론 Pod가 Ready가 되지 않을 때 확인할 순서를 8개 항목의 운영 런북으로 작성해 주세요. 각 항목에 명령 목적과 판단 기준을 한 문장씩 포함하고 180단어 이상 답하세요.
  - id: vllm-capacity-ko
    messages:
      - role: user
        content: 6GB GPU에서 vLLM의 모델 가중치, KV cache, CUDA graph 메모리가 경쟁하는 원리를 초급 개발자도 이해하도록 예시와 함께 180단어 이상 설명해 주세요.
  - id: python-streaming
    messages:
      - role: user
        content: Python 표준 라이브러리만 사용해 SSE 응답에서 data 줄을 읽고 [DONE]까지 출력하는 예제 코드와 예외 처리 방식을 180단어 이상 설명해 주세요.
  - id: gitops-rollback-ko
    messages:
      - role: user
        content: 이미지 digest를 고정한 GitOps 배포에서 장애를 Git revert로 롤백하는 전체 흐름을 사전 조건, 실행, 검증, 사후 기록으로 나눠 180단어 이상 설명해 주세요.