stacks/wsl2-gpu/benchmarks/chat-shared-prefix.yaml
schema_version: 1
name: wsl2-chat-shared-prefix-thinking-off
defaults:
  model: qwen-demo
  stream: true
  stream_options:
    include_usage: true
  chat_template_kwargs:
    enable_thinking: false
  temperature: 0.0
  top_p: 1.0
  seed: 42
  max_tokens: 64
execution:
  warmup_requests: 3
  rounds: 10
  concurrency: 2
  timeout_seconds: 180
prompts:
  - id: shared-prefix-security
    messages:
      - role: system
        content: &platform_context |
          다음은 GPU 추론 플랫폼의 공통 운영 문맥이다. Windows 호스트의 NVIDIA 드라이버가 WSL2에 GPU를 전달하며 WSL 안에는 별도 Linux GPU 드라이버를 설치하지 않는다. Ubuntu 위 Docker Desktop과 Minikube Docker driver가 Kubernetes를 실행하고 NVIDIA device plugin이 nvidia.com/gpu 리소스를 노출한다.

          KServe는 Standard Mode로 동작한다. 모델 Pod는 replica 1, Recreate 전략, GPU 1개, 메모리 캐시 PVC와 /dev/shm을 사용한다. vLLM은 Qwen3-1.7B revision 고정, float16, 최대 문맥 1024, 최대 시퀀스 1, thinking 비활성, GPU memory utilization 0.75와 prefix caching 활성으로 실행한다. 양자화, CPU offload, swap, Istio, Knative는 사용하지 않는다.

          클라이언트는 Windows 사설 LAN 8000 포트의 FastAPI Gateway만 호출한다. Gateway는 API key 인증, rate limit, 요청 형식 검증, qwen-demo를 실제 모델명으로 변환, thinking 비활성 강제, JSON과 SSE streaming 중계를 담당한다. predictor Service와 vLLM 원본 API, Kubernetes API, Argo CD는 외부에 공개하지 않는다.

          GitHub Actions는 테스트, Gateway linux/amd64 이미지 build, GHCR digest push, GitOps values 변경까지만 담당한다. Argo CD가 Git을 pull하여 Helm 리소스를 자동 sync하며 집 Kubernetes에 대한 inbound CI 연결은 없다. 장애 롤백은 배포된 리소스를 직접 편집하지 않고 Git revert로 수행한다.

          운영 검증은 성공률, TTFT, TPOT, E2E, 출력 처리량, VRAM, system RAM, GPU 사용률, 온도, clock, 전력과 재시작 여부를 기록한다. 대화형 기본 SLO는 성공률 100%, TTFT p95 1초 이하, TPOT p95 100ms 이하, VRAM 여유 512MiB 이상이다.
      - role: user
        content: 이 구조에서 인터넷에 공개하면 안 되는 세 가지를 답하세요.
  - id: shared-prefix-cd
    messages:
      - role: system
        content: *platform_context
      - role: user
        content: Gateway 변경이 실제 모델 API까지 배포되는 순서를 화살표로 답하세요.
  - id: shared-prefix-slo
    messages:
      - role: system
        content: *platform_context
      - role: user
        content: 대화형 성능 합격 조건 네 가지를 짧게 답하세요.